tpm-pcr07.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-12 Thu 04:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PCRS on Red Hat Enterprise Linux.</title>
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
<meta http-equiv="Content-Security-Policy" content="style-src-elem 'self' https://wmealing.github.io;">
<link rel="stylesheet" href="index.css">
<meta name="author" content="Wade Mealing" />
<meta name="description" content="Using PCRS on RHEL" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">PCRS on Red Hat Enterprise Linux.</h1>
<nav class="navbar-custom">
    <div class="navbar-grid">

        <div class="navbar-section">
            <a href="systems.html" style="text-decoration: none;"><h3>Systems & Distributed Programming</h3></a>
            <div class="navbar-tags">
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Erlang/OTP</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Clojure</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Lisp Flavored Erlang</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag special">Cellium (TUI Framework)</span></a>
            </div>
        </div>

        <div class="navbar-section">
            <a href="security.html" style="text-decoration: none;"><h3>Security & Kernel Research</h3></a>
            <div class="navbar-tags">
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Linux Kernel Analysis</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">eBPF</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Malware Reversing</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Rust</span></a>
            </div>
        </div>

        <div class="navbar-section">
            <a href="tooling.html" style="text-decoration: none;"><h3>Tooling & Workflow</h3></a>
            <div class="navbar-tags">
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">Emacs / Elisp</span></a>
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">CI/CD Pipelines</span></a>
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">OpenSCAD</span></a>
            </div>
        </div>

    </div>
</nav>
<p>
Most modern systems have a TPM implemented in hardware of the system that is frequently used as a method to ensure platform integrity of system level components.
</p>

<p>
TPM status is communicated with the operating system through “Trusted Platform Configuration Register (PCR) settings.   The TPM has several different PCR which are used for different, specific purposes. Some of these registers are intended to be used as hardware and software validation methods to ensure that an “Evil maid” attack has not taken place between boots.
</p>

<p>
Some attacks may modify the boot process to gain additional privileges while the system is running.
</p>
<div id="outline-container-org3b1f81a" class="outline-2">
<h2 id="org3b1f81a">Option 1 : LUKS decryption on PCRS validation.</h2>
<div class="outline-text-2" id="text-org3b1f81a">
<p>
As the TPM is hardware it doesn’t have the ability to make intelligent decisions to interfere with the boot process.  If the system has booted in a modified state ( such as modified boot code), the PCR values will be different but the boot will proceed.  The TPM device can be configured to refuse to hand over internal secrets unless the values are accepted as correct.
</p>

<p>
Any block devices that are configured to ‘bind’ against these PCRs will fail to decrypt.  
</p>

<p>
For example, if /dev/sda3 was required to validate against PCR 7 with the command:
</p>


<div class="org-src-container">
<pre class="src src-shell"># clevis luks bind -d /dev/sda3 tpm2 '{"pcr_ids":"7"}'
</pre>
</div>

<p>
The device will fail to decrypt at boot time if the PCR has changed between the time that the command was issued and boot.  Using PCR 7 specifically means that operating system upgrades will not affect the ability of a system to booth.  Other PCR’s may be reset or modified.  If an attacker manages to evade secure boot PCR-7 will be modified.
</p>
</div>
</div>
<div id="outline-container-orgde1959a" class="outline-2">
<h2 id="orgde1959a">Option 2: Integrity Measurement Architecture (IMA).</h2>
<div class="outline-text-2" id="text-orgde1959a">
<p>
The Linux Integrity Measurement Architecture (IMA) subsystem capable of attestation of modification of files by calculating checksums and comparing them against known good/trusted states.
</p>

<p>
The Red Hat Enterprise Linux 8 documentation covers setting up IMA, please follow this guide for initial configuration of IMA in the environment.
</p>

<p>
Once configured, the boot_aggregate line in /sys/kernel/security/ima/ascii_runtime_measurements has a value that will be shown as different when changes to the TPM are made between system boots.  
</p>

<p>
The boot_aggregate entry format depends on the template chosen, being the default for RHEL-8 the following one: 
</p>

<div class="org-src-container">
<pre class="src src-shell">$ cat /sys/kernel/security/ima/ascii_runtime_measurements | grep boot_aggregate
10 ef2be9c304d9bbbd8ecb40f0d296176d2b5d3078 ima-ng sha1:4663ed64e5dbbb9755a0914b1a15fa76a1797806 boot_aggregate
</pre>
</div>

<p>
Once a known good value is obtained, this aggregate will persist between reboots of the same boot shim/ bootloader and kernel.  Periodically comparing this value to known trusted states will ensure the system is in a known-good state.
</p>

<p>
There may be a method to fail the boot on this aggregate being different but I do not know it yet. 
</p>
</div>
</div>
<div id="outline-container-org49caa97" class="outline-2">
<h2 id="org49caa97">Additional Information:</h2>
<div class="outline-text-2" id="text-org49caa97">
<p>
[Wikipedia on TPM](<a href="https://en.wikipedia.org/wiki/Trusted_Platform_Module">https://en.wikipedia.org/wiki/Trusted_Platform_Module</a>)
</p>

<p>
[MJG on TPM](<a href="https://mjg59.dreamwidth.org/48897.html">https://mjg59.dreamwidth.org/48897.html</a>)
</p>

<p>
[TPM spec](<a href="https://trustedcomputinggroup.org/wp-content/uploads/PC-ClientSpecific_Platform_Profile_for_TPM_2p0_Systems_v51.pdf">https://trustedcomputinggroup.org/wp-content/uploads/PC-ClientSpecific_Platform_Profile_for_TPM_2p0_Systems_v51.pdf</a>)
</p>

<p>
[TPM unlucking](<a href="https://blog.dowhile0.org/2017/10/18/automatic-luks-volumes-unlocking-using-a-tpm2-chip/">https://blog.dowhile0.org/2017/10/18/automatic-luks-volumes-unlocking-using-a-tpm2-chip/</a>)
</p>

<p>
[Red Hats guide on TPM and Security](<a href="https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/8/html/managing_monitoring_and_updating_the_kernel/enhancing-security-with-the-kernel-integrity-subsystem_managing-monitoring-and-updating-the-kernel">https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/8/html/managing_monitoring_and_updating_the_kernel/enhancing-security-with-the-kernel-integrity-subsystem_managing-monitoring-and-updating-the-kernel</a>)
</p>

<p>
[LWN](<a href="https://lwn.net/Articles/137306/">https://lwn.net/Articles/137306/</a>)
</p>
</div>
</div>
</div>
</body>
</html>
